tap "datum-cloud/tap"
tap "oven-sh/bun"
brew "ack"
brew "adns"
brew "gmp"
brew "xz"
brew "zstd"
brew "gcc"
brew "openssl@3"
brew "python@3.12"
brew "aider"
brew "brotli"
brew "webp"
brew "argo"
brew "aspell"
brew "autoconf"
brew "automake"
brew "aws-shell"
brew "awscli"
brew "azure-cli"
brew "bdw-gc"
brew "btop"
brew "bzip2"
brew "c-ares"
brew "glib"
brew "cloudflared"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "deno"
brew "docutils"
brew "fastfetch"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fortune"
brew "gh"
brew "git"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "go"
brew "netpbm"
brew "libtool"
brew "graphviz"
brew "grc"
brew "grpcurl"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "libfido2"
brew "libpq"
brew "libuv"
brew "libzip"
brew "llvm"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "make"
brew "mkcert"
brew "mysql-client"
brew "node"
brew "neonctl"
brew "neovim"
brew "pandoc"
brew "pinentry-mac"
brew "pkgconf"
brew "pnpm"
brew "postgresql@16", link: true
brew "protobuf"
brew "psutils"
brew "pulumi"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "redis"
brew "render"
brew "ripgrep"
brew "rustup"
brew "starship"
brew "stylua"
brew "tailwindcss-language-server"
brew "tcl-tk"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "uv"
brew "vercel-cli"
brew "vscode-langservers-extracted"
brew "watch"
brew "wget"
brew "zig"
brew "zls"
brew "datum-cloud/tap/datumctl"
brew "oven-sh/bun/bun"
cask "basictex"
cask "claude-code"
cask "discord", args: { appdir: "/Applications" }
cask "docker-desktop", args: { appdir: "/Applications" }
cask "figma"
cask "firefox", args: { appdir: "/Applications" }
cask "font-monaspace"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome", args: { appdir: "/Applications" }
cask "macfuse", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "visual-studio-code"
cask "visual-studio-code@insiders"
