tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
tap "planetscale/tap"
tap "render-oss/render"
brew "ack"
brew "adns"
brew "brotli"
brew "xz"
brew "zstd"
brew "webp"
brew "argo"
brew "aspell"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "python@3.12"
brew "aws-shell"
brew "awscli"
brew "azure-cli"
brew "bdw-gc"
brew "btop"
brew "bzip2"
brew "c-ares"
brew "glib"
brew "gmp"
brew "coreutils"
brew "curl"
brew "deno"
brew "docutils"
brew "fastfetch"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fortune"
brew "gh"
brew "git"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "go"
brew "grc"
brew "grpcurl"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "libfido2"
brew "libpq"
brew "libtool"
brew "libzip"
brew "llvm"
brew "mysql-client"
brew "netpbm"
brew "node"
brew "node@20"
brew "pandoc"
brew "pinentry-mac"
brew "pkgconf"
brew "protobuf"
brew "psutils"
brew "python@3.10"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rustup"
brew "tcl-tk"
brew "tmux"
brew "tpm"
brew "tree"
brew "uv"
brew "vercel-cli"
brew "watch"
brew "wget"
brew "zig"
brew "zls"
brew "oven-sh/bun/bun"
brew "planetscale/tap/pscale"
brew "render-oss/render/render"
cask "basictex"
cask "cap"
cask "discord", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "figma"
cask "firefox", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "google-cloud-sdk"
cask "macfuse", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "visual-studio-code"
cask "zoom", args: { appdir: "/Applications" }
