cask_args app: "/Applications"

tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
tap "planetscale/tap"
tap "render-oss/render"

brew "ack"
brew "adns"
brew "argo"
brew "aspell"
brew "autoconf"
brew "automake"
brew "azure-cli"
brew "bdw-gc"
brew "brotli"
brew "bun"
brew "bzip2"
brew "c-ares"
brew "coreutils"
brew "curl"
brew "gh"
brew "git"
brew "glib"
brew "gmp"
brew "gnutls"
brew "gnupg"
brew "go"
brew "grc"
brew "htop"
brew "jq"
brew "libtool"
brew "libzip"
brew "node"
brew "openssl"
brew "pinentry-mac"
brew "pinentry"
brew "pkg-config"
brew "protobuf"
brew "pyenv"
brew "rbenv"
brew "readline"
brew "ruby-build"
brew "rustup"
brew "tmux"
brew "tree"
brew "unbound"
brew "watch"
brew "webp"
brew "wget"
brew "xz"
brew "zig"
brew "zlib"

cask "macfuse"
cask "docker"
cask "slack"
cask "discord"
cask "spotify"
cask "zoom"
cask "visual-studio-code"
cask "google-chrome"
cask "firefox"
cask "figma"
