tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
tap "planetscale/tap"
tap "render-oss/render"
brew "ack"
brew "adns"
brew "brotli"
brew "xz"
brew "zstd"
brew "webp"
brew "argo"
brew "aspell"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "python@3.12"
brew "aws-shell"
brew "python@3.11"
brew "azure-cli"
brew "bdw-gc"
brew "gmp"
brew "btop"
brew "bzip2"
brew "c-ares"
brew "glib"
brew "coreutils"
brew "curl"
brew "deno"
brew "docutils"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fortune"
brew "gh"
brew "git"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "go"
brew "grc"
brew "grpcurl"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "libfido2"
brew "libpq"
brew "libtool"
brew "libzip"
brew "llvm"
brew "mysql-client"
brew "netpbm"
brew "node"
brew "node@20"
brew "pandoc"
brew "pinentry-mac"
brew "pkg-config"
brew "protobuf"
brew "psutils"
brew "python@3.10"
brew "ruby-build"
brew "rbenv"
brew "rustup"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "uv"
brew "vercel-cli"
brew "watch"
brew "wget"
brew "zig"
brew "zls"
brew "oven-sh/bun/bun"
brew "planetscale/tap/pscale"
brew "render-oss/render/render"
cask "basictex"
cask "discord", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "figma"
cask "firefox", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "macfuse", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "visual-studio-code"
cask "zoom", args: { appdir: "/Applications" }
vscode "albymor.increment-selection"
vscode "aliariff.vscode-erb-beautify"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "charliermarsh.ruff"
vscode "coolbear.systemd-unit-file"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "eriklynd.json-tools"
vscode "figma.figma-vscode-extension"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "james-yu.latex-workshop"
vscode "jnbt.vscode-rufo"
vscode "marcoroth.stimulus-lsp"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "vortizhe.simple-ruby-erb"
vscode "waderyan.gitblame"
vscode "william-voyek.vscode-nginx"
vscode "ziglang.vscode-zig"
vscode "zxh404.vscode-proto3"
